app/views/properties/index.html.erb

        <td id="code"><%= property.Code %></td>
        <td><%= property.shares.where("user_id =?", current_user).count %></td>
---
SELECT COUNT(*) FROM "shares" WHERE "shares"."property_id" = ? AND (user_id =5)  [["property_id", 3]]

        <!-- <td><%= link_to new_property_share_buy_request_path(:property_id => property.id), remote: true, class: 'btn btn-success' do %>
          BUY <%= property.shares.where(user_id: nil, status: false).count %><% end %></td> -->
---
SELECT COUNT(*) FROM "shares" WHERE "shares"."property_id" = ? AND ("shares"."user_id" IS NOT NULL) AND ("shares"."status" != ?)  [["property_id", 3], ["status", true]]