app/views/properties/show.html.erb

SELECT  "shares".* FROM "shares" WHERE "shares"."property_id" = ? AND "shares"."status" = ? LIMIT ?  [["property_id", 3], ["status", true], ["LIMIT", 1]]
SELECT COUNT(*) FROM "shares" WHERE "shares"."property_id" = ? AND (status ='t')  [["property_id", 3]]
---
            <td><strong>Your Total Share Value as Per Market Valuation</strong></td>
            <td><% if @property.shares.where("status =?", true).count > 0 %>

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT COUNT(*) FROM "shares" WHERE "shares"."share_sell_request_id" = ? AND (status ='f')  [["share_sell_request_id", 9]]
---
                <tr>
                  <td><%= Property.find(share_sell_request.property_id).Code %></td>
                  <% if share_sell_request.shares.where("status =?", false).count < 1 %>