app/views/shared/_navigation.html.erb

SELECT COUNT(*) FROM "shares" WHERE "shares"."user_id" = ?  [["user_id", 5]]
---
      &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;<br>
      My Shares: <%= current_user.shares.count %>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;

SELECT COUNT(*) FROM "share_buy_requests" WHERE "share_buy_requests"."user_id" = ?  [["user_id", 5]]
---
                <% else %>
                  <% if current_user.share_buy_requests.count > 0 %>

SELECT COUNT(*) FROM "share_sell_requests" WHERE "share_sell_requests"."user_id" = ?  [["user_id", 5]]
---
                <% else %>
                  <% if current_user.share_sell_requests.count > 0 %>