app/views/share_sell_requests/index.html.erb

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "shares" WHERE "shares"."share_sell_request_id" = ?  [["share_sell_request_id", 13]]
---
      <tr>
        <td><%= Property.find(share_sell_request.property_id).Code %></td>
        <td><%= User.find(share_sell_request.user_id).full_name %></td>
        <td><%= Share.where(share_sell_request_id: share_sell_request.id).count %></td>