app/views/share_buy_requests/show.html.erb

  <strong>M/s</strong>
  <%= User.find(@share_buy_request.user_id).full_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

You have expressed interest to buy <%= @share_buy_request.no_of_shares %> shares from
<% if @share_buy_request.shares.first.share_sell_request_id? %> User:
---
SELECT  "shares".* FROM "shares" WHERE "shares"."share_buy_request_id" = ? ORDER BY "shares"."id" ASC LIMIT ?  [["share_buy_request_id", 6], ["LIMIT", 1]]