app/controllers/properties_controller.rb

  def index
    # @properties = current_user.properties.find(params[:id])
    @properties = Property.where("EndOffer <?", Date.today)
---
SELECT "properties".* FROM "properties" WHERE (EndOffer <'2017-04-24')

  def show
    @property = Property.find(params[:id])
    @sell_requests = @property.share_sell_requests.where.not(user_id: current_user)
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "properties".* FROM "properties" ORDER BY "properties"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "shares".* FROM "shares" WHERE "shares"."user_id" = 3 ORDER BY "shares"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "share_sell_requests".* FROM "share_sell_requests" WHERE "share_sell_requests"."property_id" = ? AND ("share_sell_requests"."user_id" != 5) AND (validity_days >'2017-04-24')  [["property_id", 3]]

  def update
    @property.Rate = ((@property.CurrentPrice - @property.Price) / @property.Price) * 100
    @property.ShareValue = @property.CurrentPrice / @property.Shares
    # update share value in individual shares
    @property.shares.update_all(value: @property.ShareValue)
---
UPDATE "properties" SET "CurrentPrice" = ?, "brochure" = ?, "updated_at" = ? WHERE "properties"."id" = ?  [["CurrentPrice", 0.15e6], ["brochure", ""], ["updated_at", 2017-04-25 07:00:27 UTC], ["id", 3]]
UPDATE "shares" SET "value" = 10000.0 WHERE "shares"."property_id" = ?  [["property_id", 3]]