app/controllers/share_buy_requests_controller.rb

SELECT "share_buy_requests".* FROM "share_buy_requests" WHERE (user_id =5)
---
  def index
    if current_user.superadmin_role? && current_user.supervisor_role?
      @share_buy_requests = ShareBuyRequest.all

SELECT  "properties".* FROM "properties" WHERE "properties"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "share_sell_requests".* FROM "share_sell_requests" WHERE "share_sell_requests"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "shares" WHERE (share_sell_request_id =9) AND (status ='f')
INSERT INTO "share_buy_requests" ("property_id", "user_id", "no_of_shares", "created_at", "updated_at", "share_sell_request_id", "total") VALUES (?, ?, ?, ?, ?, ?, ?)  [["property_id", 1], ["user_id", 5], ["no_of_shares", 1515], ["created_at", 2017-04-24 12:35:30 UTC], ["updated_at", 2017-04-24 12:35:30 UTC], ["share_sell_request_id", 9], ["total", 0.80295e7]]
---
  def create
    @share_buy_request = ShareBuyRequest.new(share_buy_request_params)
    puts @share_buy_request
    @share_buy_request.user_id = current_user.id
    # @property = Property.find_by_Code(@share_buy_request.property_id)
    @property_id = Property.find_by_id(params[:property_id])
      # either assign property id or share sell request id
      if (@share_buy_request.share_sell_request_id != nil)
        @shares = Share.where("share_sell_request_id =?", @share_buy_request.share_sell_request_id)
        @share_buy_request.total = ShareSellRequest.find(@share_buy_request.share_sell_request_id).sale_price * @share_buy_request.no_of_shares + (300 * @share_buy_request.no_of_shares)
      else
        @shares = Share.where("property_id =?", @share_buy_request.property_id)
        @share_buy_request.total = Share.find_by_property_id(@share_buy_request.property_id).value * @share_buy_request.no_of_shares
      end
    @share_buy_request.property_id = @share_buy_request.property_id


    respond_to do |format|
      if @share_buy_request.save && @shares.where("status =?", false).count >= @share_buy_request.no_of_shares

SELECT  "share_buy_requests".* FROM "share_buy_requests" WHERE "share_buy_requests"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_share_buy_request
      @share_buy_request = ShareBuyRequest.find(params[:id])