app/controllers/share_sell_requests_controller.rb

  def index
    if current_user.superadmin_role? && current_user.supervisor_role?
      @share_sell_requests = ShareSellRequest.all
---
SELECT "share_sell_requests".* FROM "share_sell_requests" WHERE (user_id =3)

    def set_share_sell_request
      @share_sell_request = ShareSellRequest.find(params[:id])
---
SELECT  "share_sell_requests".* FROM "share_sell_requests" WHERE "share_sell_requests"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]